src/InformationRegisters/ПоказателиВерсийХранилища/ПоказателиВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиВерсийХранилища</name>
  <resources>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗагружены_Автотесты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтотестыОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтотестыНомерПайпа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтотестыНомерЗаданияAllure</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерхнеуровневыйПайплайнНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОшибокАвтотесты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверкаКодаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверкаКодаВручнуюОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЭтаповЗадачиМетеор/ИсторияЭтаповЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЭтаповЗадачиМетеор</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>стрИсполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СломанныеТесты/СломанныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СломанныеТесты</name>
  <resources>
    <name>КоммитИсправления</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </resources>
  <resources>
    <name>Исправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЭлектронноеПисьмо/ЭлектронноеПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмо</name>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ЭтапыЗадачиМетеор/ЭтапыЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыЗадачиМетеор</name>
  <predefined>
    <items>
      <name>АналитическаяПроработка</name>
      <description>Аналитическая проработка</description>
    </items>
    <items>
      <name>ВыполнитьОсновнуюРаботуПоЗаданию</name>
      <description>Выполнить основную работу по заданию</description>
    </items>
    <items>
      <name>ДоработкаДокументации</name>
      <description>Доработка документации</description>
    </items>
    <items>
      <name>ЗакрытьЗадание</name>
      <description>Закрыть задание</description>
    </items>
    <items>
      <name>ИсправлениеОшибок</name>
      <description>Исправление ошибок</description>
    </items>
    <items>
      <name>Ожидание</name>
      <description>Ожидание</description>
    </items>
    <items>
      <name>ОтключениеРасширения</name>
      <description>Отключение расширения</description>
    </items>
    <items>
      <name>ОшибкаОтключенияРасширения</name>
      <description>Ошибка отключения расширения</description>
    </items>
    <items>
      <name>ОшибкаПодключенияРасширения</name>
      <description>Ошибка подключения расширения</description>
    </items>
    <items>
      <name>ПодключениеРасширения</name>
      <description>Подключение расширения</description>
    </items>
    <items>
      <name>ПредварительнаяПроверкаИФормированиеДокументации</name>
      <description>Предварительная проверка (ранее также Формирование документации)</description>
    </items>
    <items>
      <name>ПредварительнаяПроверкаИФормированиеДокументации2</name>
      <description>Предварительная проверка 2</description>
    </items>
    <items>
      <name>ПроверкаДокументации</name>
      <description>Проверка документации</description>
    </items>
    <items>
      <name>ПроверкаКода</name>
      <description>Проверка кода</description>
    </items>
    <items>
      <name>ПроверкаКодаПодключениеРасширения</name>
      <description>Проверка кода подключение расширения</description>
    </items>
    <items>
      <name>РазработчикуСделатьТехпроект</name>
      <description>Разработчику сделать техпроект</description>
    </items>
    <items>
      <name>СдатьРаботуЗаказчику</name>
      <description>Сдать работу заказчику</description>
    </items>
    <items>
      <name>СогласованиеНаПодключениеРасширения</name>
      <description>Согласование на подключение расширения</description>
    </items>
    <items>
      <name>СогласоватьАрхитектуру</name>
      <description>Согласовать архитектуру</description>
    </items>
    <items>
      <name>СозданиеЗаявкиНаПереносВПродуктив</name>
      <description>Создание заявки на перенос в продуктив</description>
    </items>
    <items>
      <name>ФормированиеДокументации</name>
      <description>Формирование документации</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПоказателиВерсийХранилища/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЭтоНаборУдаления = Количество() = 0; 
	Если ЭтоНаборУдаления Тогда
		ДополнительныеСвойства.Вставить("БылоУдаление");
	КонецЕсли;
	
	Если ЭтоНаборУдаления Или Не ДополнительныеСвойства.Свойство("БылоУдаление") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ИСТИНА КАК АвтотестыЗагружены
			|ИЗ
			|	РегистрСведений.ПоказателиВерсийХранилища КАК ПоказателиВерсийХранилища
			|ГДЕ
			|	ПоказателиВерсийХранилища.ВерсияХранилища = &ВерсияХранилища
			|	И ПоказателиВерсийХранилища.ДанныеЗагружены_Автотесты";
		Запрос.УстановитьПараметр("ВерсияХранилища", Отбор.ВерсияХранилища.Значение);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ДополнительныеСвойства.Вставить("АвтотестыБылиЗагружены");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если Количество() = 1 И Не ДополнительныеСвойства.Свойство("АвтотестыБылиЗагружены") И ЭтотОбъект[0].ДанныеЗагружены_Автотесты Тогда
		ОтправитьПисьмоСОшибкамиАвтотестов(); 
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПисьмоСОшибкамиАвтотестов()
	
	ПоказателиАвтотестов = ЭтотОбъект[0];
	
	Если Не ЗначениеЗаполнено(ПоказателиАвтотестов.ОшибокАвтотесты) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРесурсов = РегистрыСведений.ЗадачиМетеорВерсийХранилища.Получить(Новый Структура("ВерсияХранилища", ПоказателиАвтотестов.ВерсияХранилища));
	ЗадачаМетеор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияРесурсов, "ЗадачаМетеор");
	
	МассивКоммитов = Новый Массив;
	МассивКоммитов.Добавить(ПоказателиАвтотестов.ВерсияХранилища);
	
	Адреса = Справочники.ИсторияХранилища.АдресаАвторовКоммитов(МассивКоммитов);
	Аналитик = РегистрыСведений.ИсторияЭтаповЗадачиМетеор.ИсполнительЭтапа(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.АналитическаяПроработка);
	Если ЗначениеЗаполнено(Аналитик.email) Тогда
		Адреса.Добавить(Аналитик.email);
	КонецЕсли;
	Ведущий = РегистрыСведений.ИсторияЭтаповЗадачиМетеор.ИсполнительЭтапа(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.СогласоватьАрхитектуру);
	Если ЗначениеЗаполнено(Ведущий.email) Тогда
		Адреса.Добавить(Ведущий.email);
	КонецЕсли;
	Разработчик = РегистрыСведений.ИсторияЭтаповЗадачиМетеор.ИсполнительЭтапа(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.ВыполнитьОсновнуюРаботуПоЗаданию);
	Если ЗначениеЗаполнено(Разработчик.email) Тогда
		Адреса.Добавить(Разработчик.email);
	КонецЕсли;
	Для Каждого Пользователь Из Справочники.Пользователи.ПользователиРоли(Справочники.РолиИсполнителей.ВладелецСистемы) Цикл
		Адреса.Добавить(Пользователь.email);
	КонецЦикла;
	Для Каждого Пользователь Из Справочники.Пользователи.ПользователиРоли(Справочники.РолиИсполнителей.Тестирование) Цикл
		Адреса.Добавить(Пользователь.email);
	КонецЦикла;
	Адреса = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Адреса);
	АдресПолучателя = СтрСоединить(Адреса, ";");
	Если НЕ ЗначениеЗаполнено(АдресПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	URLAllure = Справочники.ИсторияХранилища.URLAllure(ЭтотОбъект);
	URLJUnit  = Справочники.ИсторияХранилища.URLJUnit(ЭтотОбъект);
	
	ТемаПисьма = СтрШаблон("Ошибки автотестов по коммиту №%1", ПоказателиАвтотестов.ВерсияХранилища);
	
	ШаблонПисьма = "<!doctype html><html><head></head><body>%1</body></html>";
	
	СтрокиПисьма = Новый Массив;
	СтрокиПисьма.Добавить("<p>Ошибки автотестов</p>");
	СтрокиПисьма.Добавить(СтрШаблон("<p><a href=""%1"">Allure</a></p>", URLAllure));
	СтрокиПисьма.Добавить(СтрШаблон("<p><a href=""%1"">JUnit</a></p>", URLJUnit));
	СтрокиПисьма.Добавить(СтрШаблон("<p>Всего ошибок %1</p>", ПоказателиАвтотестов.ОшибокАвтотесты));
	
	СломанныеТесты = "";
	нз = РегистрыСведений.СломанныеТесты.СоздатьНаборЗаписей();
	нз.Отбор.Коммит.Установить(ПоказателиАвтотестов.ВерсияХранилища);
	нз.Прочитать();
	Для Каждого Запись Из нз Цикл 
		СломанныеТесты = СломанныеТесты + СтрШаблон("<li>%1/%2. По причине: %3</li>", Запись.Тест.Наименование, Запись.Тест.Класс, Запись.ТекстОшибки);
	КонецЦикла;
	СтрокиПисьма.Добавить(СтрШаблон("<ul>%1</ul>", СломанныеТесты));
	
	ТелоПисьма = СтрШаблон(ШаблонПисьма, СтрСоединить(СтрокиПисьма, Символы.ПС));
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Получатели", АдресПолучателя);
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);
	ПараметрыПисьма.Вставить("Тело", ТелоПисьма);
	Документы.ЭлектронноеПисьмо.СоздатьПисьмо(ПараметрыПисьма);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
